app/views/posts/new.html.erb


<%= form_for :post, url: "/users/#{User.find_by_id(session[:user_id]).id}/posts" do |f| %>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 5]]