app/controllers/posts_controller.rb

  def home
    @posts = Post.all.order("id ASC")
---
SELECT "posts".* FROM "posts"  ORDER BY id ASC

  def index
    @posts = User.find_by_id(session[:user_id]).posts
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 5]]
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = ?  [["user_id", 5]]

  def create
  	@user = User.find_by_id(session[:user_id])
    @post = @user.posts.new(post_params)
    if @post.save
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 5]]
INSERT INTO "posts" ("title", "subhead", "content", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

  def destroy
  	Post.find_by_id(params[:id]).destroy
---
DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 16]]
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 16]]