app/controllers/users_controller.rb

INSERT INTO "users" ("name", "email", "password_hash", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)
---
  def create
    user = User.new(user_params)
    if user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 5]]
---
  def show
    @user = User.find_by_id(session[:user_id])